app/controllers/employee_applications_controller.rb

  def retrieve
    if (params[:mode] == 'status') then
      required_fields = ['app_code', 'first_name', 'last_name']
      if !contactFormvalidity(required_fields, nil)
        @status = 'Invalid Parameter'
        @result = nil
      else
        @result = EmployeeApplication.getAppStatus(params[:app_code], params[:first_name], params[:last_name])
      end
    elsif (params[:mode] == 'byId') then
      required_fields = ['app_code']
      if !contactFormvalidity(required_fields, nil)
        @status = 'Invalid Parameter'
        @result = nil
      else
        applicationId = params[:app_code]
        @result = EmployeeApplication.employeeApplicationSearch(nil, applicationId)
      end
    elsif (params[:mode] == 'all') then
      @result = EmployeeApplication.all
---
SELECT * FROM `employee_applications` WHERE (application_code = 'EA2013324154450JT' AND first_name='Justin' AND last_name='Timberlake') LIMIT 1

  def create
    #debugger
    @stparams = params[:employee_application]
    @employee_application = EmployeeApplication.new(params[:employee_application])
    #debugger
    required_fields = ['experience', 'first_name', 'last_name', 'email', 'marital_status', 'dob', 'gender', 'mobile_phone', 'education', 'address', 'city', 'state', 'zipcode', 'country', 'ssn', 'applying_for', 'employment_type', 'period', 'emergency_name', 'emergency_mobile_number', 'emergency_relationship', 'emergency_address', 'emergency_city', 'emergency_state', 'emergency_zipcode', 'emergency_country']
    #debugger
    if !contactFormvalidity(required_fields, @employee_application)
      respond_to do |format|
        format.json { render :json => {:errors=>{:status => 110, :message => "Required parameter not provided"}}, :status => :unprocessable_entity }
      end
    else
      #debugger
      @employee_application.application_code = EmployeeApplication.generateAppID(@stparams[:first_name], @stparams[:last_name], @stparams[:applying_for])
      @employee_application.submitted_on = Date.today

      respond_to do |format|
        if @employee_application.save
---
INSERT INTO `employee_applications` (`employer_state`, `emergency_state`, `signed`, `dl_issue`, `emergency_zipcode`, `marital_status`, `address`, `dl_number`, `emergency_city`, `medication`, `first_name`, `email`, `employment_type`, `period`, `employer_zipcode`, `remarks`, `city`, `emergency_mobile_number`, `emergency_relationship`, `submitted_on`, `mobile_phone`, `state`, `application_code`, `gender`, `other_phone`, `country`, `emergency_home_number`, `zipcode`, `ssn`, `employer_name`, `employer_address`, `employer_city`, `emergency_name`, `summary`, `accepted`, `last_name`, `applying_for`, `employer_number`, `employer_country`, `emergency_address`, `education`, `experience`, `emergency_country`, `dob`, `home_phone`, `physical_disability`, `referrer`) VALUES(NULL, 'Virginia', NULL, NULL, '23508', 'single', '1245 Fairfax Avenue', NULL, 'Norfolk', NULL, 'Xander', 'ag-silver@live.com', 'Full_Time_40hr', 'DAY', NULL, NULL, 'Aurora', '7567987', 'Sister', '2013-07-26', '7567987', 'Colorado', 'EA2013726231715XF', 'Male', NULL, 'United States', NULL, '80016', '43559', NULL, NULL, NULL, 'Janet', NULL, NULL, 'Fort', 'Administrator', NULL, NULL, '1679 academy street', 'A High School Graduate', '4-6months', 'United States', '1992-09-18', NULL, NULL, NULL)