app/controllers/student_applications_controller.rb

        @result = StudentApplication.studentApplicationSearch(admission_session, nil, nil)
      end
    elsif (params[:mode] == 'all') then
      @result = StudentApplication.all
---
SELECT * FROM `student_applications` WHERE (application_code = 'SMB201361482554BT' AND first_name='Bentest2' AND last_name='TestUser2') LIMIT 1

  def create
    #debugger
    @stparams = params[:student_application]
    @student_application = StudentApplication.new(params[:student_application])
    #debugger
    required_fields = ['admission_session', 'first_name', 'last_name', 'email', 'marital_status', 'dob', 'gender', 'mobile_phone', 'education', 'address', 'city', 'state', 'zipcode', 'country', 'ssn', 'applying_for', 'student_type', 'period', 'emergency_name', 'emergency_mobile_number', 'emergency_relationship', 'emergency_address', 'emergency_city', 'emergency_state', 'emergency_zipcode', 'emergency_country']
    #debugger
    if !contactFormvalidity(required_fields, @student_application)
      respond_to do |format|
        format.json { render :json => {:errors=>{:status => 110, :message => "Required parameter not provided"}}, :status => :unprocessable_entity }
      end
    else
      #check if this application has already been saved
      @duplicate_student_application = StudentApplication.findDuplicate(@stparams)
      if @duplicate_student_application != nil
        sendEmail('student', @duplicate_student_application)
        respond_to do |format|
          format.json { render :json => {:status => 0, :message => 'success', :response =>@duplicate_student_application}, :status => :created}
        end
      else
        @student_application.application_code = StudentApplication.generateAppID(@stparams[:first_name], @stparams[:last_name], @stparams[:applying_for])
        @student_application.submitted_on = Date.today

        respond_to do |format|
          if @student_application.save
---
INSERT INTO `student_applications` (`country`, `admission_session`, `medication`, `emergency_address`, `employer_city`, `submitted_on`, `education`, `dl_number`, `dl_issue`, `amount`, `accepted`, `first_name`, `employer_state`, `employer_country`, `emergency_name`, `summary`, `dob`, `state`, `applying_for`, `emergency_state`, `emergency_zipcode`, `paid`, `signed`, `address`, `student_type`, `employer_name`, `emergency_home_number`, `referrer`, `last_name`, `marital_status`, `zipcode`, `emergency_mobile_number`, `application_code`, `email`, `gender`, `home_phone`, `mobile_phone`, `period`, `committment`, `physical_disability`, `emergency_relationship`, `emergency_city`, `emergency_country`, `ssn`, `employer_address`, `remarks`, `other_phone`, `city`, `employer_number`, `employer_zipcode`) VALUES('United States', '2014 - April Admission', NULL, '1679 academy street', NULL, '2013-07-22 04:00:00', 'A High School Graduate', NULL, NULL, NULL, 'PENDING', 'Craig', NULL, NULL, 'Janet', NULL, '1992-09-18', 'Colorado', 'Master Barber', 'Virginia', '23508', 'NO', NULL, '1245 Fairfax Avenue', 'Full_Time_40hr', NULL, NULL, NULL, 'Gudin', 'single', '80016', '7567987', 'SMB201372222134CG', 'ag-silver@live.com', 'Female', NULL, '7567987', 'DAY', NULL, NULL, 'Sister', 'Norfolk', 'United States', '43559', NULL, NULL, NULL, 'Aurora', NULL, NULL)

  def update

    @stparams = params[:student_application]
    required_fields = ['id']
    if !contactFormvalidity(required_fields, @stparams)
      respond_to do |format|
        format.json { render :json => {:errors=>{:status => 110, :message => "Required parameter not provided"}}, :status => :unprocessable_entity }
      end
    else
      @student_application = StudentApplication.find(params[:id])

      respond_to do |format|
        if @student_application.update_attributes(@stparams)
---
SELECT * FROM `student_applications` WHERE (`student_applications`.`id` = 20)
UPDATE `student_applications` SET `email` = 'Slytestupdate@mailinator.com' WHERE `id` = 20